GopalSaraf/Practicals/PSDL/include/proc/pic16f1615.inc
// Register: PID1ACCHL
#define PID1ACCHL PID1ACCHL
PID1ACCHL                                equ 0611h
// bitfield definitions
PID1ACCHL_PID1ACC16_POSN                 equ 0000h
PID1ACCHL_PID1ACC16_POSITION             equ 0000h
PID1ACCHL_PID1ACC16_SIZE                 equ 0001h
PID1ACCHL_PID1ACC16_LENGTH               equ 0001h
PID1ACCHL_PID1ACC16_MASK                 equ 0001h
PID1ACCHL_PID1ACC17_POSN                 equ 0001h
PID1ACCHL_PID1ACC17_POSITION             equ 0001h
PID1ACCHL_PID1ACC17_SIZE                 equ 0001h
PID1ACCHL_PID1ACC17_LENGTH               equ 0001h
PID1ACCHL_PID1ACC17_MASK                 equ 0002h
PID1ACCHL_PID1ACC18_POSN                 equ 0002h
PID1ACCHL_PID1ACC18_POSITION             equ 0002h
PID1ACCHL_PID1ACC18_SIZE                 equ 0001h
PID1ACCHL_PID1ACC18_LENGTH               equ 0001h
PID1ACCHL_PID1ACC18_MASK                 equ 0004h
PID1ACCHL_PID1ACC19_POSN                 equ 0003h
PID1ACCHL_PID1ACC19_POSITION             equ 0003h
PID1ACCHL_PID1ACC19_SIZE                 equ 0001h
PID1ACCHL_PID1ACC19_LENGTH               equ 0001h
PID1ACCHL_PID1ACC19_MASK                 equ 0008h
PID1ACCHL_PID1ACC20_POSN                 equ 0004h
PID1ACCHL_PID1ACC20_POSITION             equ 0004h
PID1ACCHL_PID1ACC20_SIZE                 equ 0001h
PID1ACCHL_PID1ACC20_LENGTH               equ 0001h
PID1ACCHL_PID1ACC20_MASK                 equ 0010h
PID1ACCHL_PID1ACC21_POSN                 equ 0005h
PID1ACCHL_PID1ACC21_POSITION             equ 0005h
PID1ACCHL_PID1ACC21_SIZE                 equ 0001h
PID1ACCHL_PID1ACC21_LENGTH               equ 0001h
PID1ACCHL_PID1ACC21_MASK                 equ 0020h
PID1ACCHL_PID1ACC22_POSN                 equ 0006h
PID1ACCHL_PID1ACC22_POSITION             equ 0006h
PID1ACCHL_PID1ACC22_SIZE                 equ 0001h
PID1ACCHL_PID1ACC22_LENGTH               equ 0001h
PID1ACCHL_PID1ACC22_MASK                 equ 0040h
PID1ACCHL_PID1ACC23_POSN                 equ 0007h
PID1ACCHL_PID1ACC23_POSITION             equ 0007h
PID1ACCHL_PID1ACC23_SIZE                 equ 0001h
PID1ACCHL_PID1ACC23_LENGTH               equ 0001h
PID1ACCHL_PID1ACC23_MASK                 equ 0080h
PID1ACCHL_ACC16_POSN                     equ 0000h
PID1ACCHL_ACC16_POSITION                 equ 0000h
PID1ACCHL_ACC16_SIZE                     equ 0001h
PID1ACCHL_ACC16_LENGTH                   equ 0001h
PID1ACCHL_ACC16_MASK                     equ 0001h
PID1ACCHL_ACC17_POSN                     equ 0001h
PID1ACCHL_ACC17_POSITION                 equ 0001h
PID1ACCHL_ACC17_SIZE                     equ 0001h
PID1ACCHL_ACC17_LENGTH                   equ 0001h
PID1ACCHL_ACC17_MASK                     equ 0002h
PID1ACCHL_ACC18_POSN                     equ 0002h
PID1ACCHL_ACC18_POSITION                 equ 0002h
PID1ACCHL_ACC18_SIZE                     equ 0001h
PID1ACCHL_ACC18_LENGTH                   equ 0001h
PID1ACCHL_ACC18_MASK                     equ 0004h
PID1ACCHL_ACC19_POSN                     equ 0003h
PID1ACCHL_ACC19_POSITION                 equ 0003h
PID1ACCHL_ACC19_SIZE                     equ 0001h
PID1ACCHL_ACC19_LENGTH                   equ 0001h
PID1ACCHL_ACC19_MASK                     equ 0008h
PID1ACCHL_ACC20_POSN                     equ 0004h
PID1ACCHL_ACC20_POSITION                 equ 0004h
PID1ACCHL_ACC20_SIZE                     equ 0001h
PID1ACCHL_ACC20_LENGTH                   equ 0001h
PID1ACCHL_ACC20_MASK                     equ 0010h
PID1ACCHL_ACC21_POSN                     equ 0005h
PID1ACCHL_ACC21_POSITION                 equ 0005h
PID1ACCHL_ACC21_SIZE                     equ 0001h
PID1ACCHL_ACC21_LENGTH                   equ 0001h
PID1ACCHL_ACC21_MASK                     equ 0020h
PID1ACCHL_ACC22_POSN                     equ 0006h
PID1ACCHL_ACC22_POSITION                 equ 0006h
PID1ACCHL_ACC22_SIZE                     equ 0001h
PID1ACCHL_ACC22_LENGTH                   equ 0001h
PID1ACCHL_ACC22_MASK                     equ 0040h
PID1ACCHL_ACC23_POSN                     equ 0007h
PID1ACCHL_ACC23_POSITION                 equ 0007h
PID1ACCHL_ACC23_SIZE                     equ 0001h
PID1ACCHL_ACC23_LENGTH                   equ 0001h
PID1ACCHL_ACC23_MASK                     equ 0080h

// Register: PID1ACCHH
#define PID1ACCHH PID1ACCHH
PID1ACCHH                                equ 0612h
// bitfield definitions
PID1ACCHH_PID1ACC24_POSN                 equ 0000h
PID1ACCHH_PID1ACC24_POSITION             equ 0000h
PID1ACCHH_PID1ACC24_SIZE                 equ 0001h
PID1ACCHH_PID1ACC24_LENGTH               equ 0001h
PID1ACCHH_PID1ACC24_MASK                 equ 0001h
PID1ACCHH_PID1ACC25_POSN                 equ 0001h
PID1ACCHH_PID1ACC25_POSITION             equ 0001h
PID1ACCHH_PID1ACC25_SIZE                 equ 0001h
PID1ACCHH_PID1ACC25_LENGTH               equ 0001h
PID1ACCHH_PID1ACC25_MASK                 equ 0002h
PID1ACCHH_PID1ACC26_POSN                 equ 0002h
PID1ACCHH_PID1ACC26_POSITION             equ 0002h
PID1ACCHH_PID1ACC26_SIZE                 equ 0001h
PID1ACCHH_PID1ACC26_LENGTH               equ 0001h
PID1ACCHH_PID1ACC26_MASK                 equ 0004h
PID1ACCHH_PID1ACC27_POSN                 equ 0003h
PID1ACCHH_PID1ACC27_POSITION             equ 0003h
PID1ACCHH_PID1ACC27_SIZE                 equ 0001h
PID1ACCHH_PID1ACC27_LENGTH               equ 0001h
PID1ACCHH_PID1ACC27_MASK                 equ 0008h
PID1ACCHH_PID1ACC28_POSN                 equ 0004h
PID1ACCHH_PID1ACC28_POSITION             equ 0004h
PID1ACCHH_PID1ACC28_SIZE                 equ 0001h
PID1ACCHH_PID1ACC28_LENGTH               equ 0001h
PID1ACCHH_PID1ACC28_MASK                 equ 0010h
PID1ACCHH_PID1ACC29_POSN                 equ 0005h
PID1ACCHH_PID1ACC29_POSITION             equ 0005h
PID1ACCHH_PID1ACC29_SIZE                 equ 0001h
PID1ACCHH_PID1ACC29_LENGTH               equ 0001h
PID1ACCHH_PID1ACC29_MASK                 equ 0020h
PID1ACCHH_PID1ACC30_POSN                 equ 0006h
PID1ACCHH_PID1ACC30_POSITION             equ 0006h
PID1ACCHH_PID1ACC30_SIZE                 equ 0001h
PID1ACCHH_PID1ACC30_LENGTH               equ 0001h
PID1ACCHH_PID1ACC30_MASK                 equ 0040h
PID1ACCHH_PID1ACC31_POSN                 equ 0007h
PID1ACCHH_PID1ACC31_POSITION             equ 0007h
PID1ACCHH_PID1ACC31_SIZE                 equ 0001h
PID1ACCHH_PID1ACC31_LENGTH               equ 0001h
PID1ACCHH_PID1ACC31_MASK                 equ 0080h
PID1ACCHH_ACC24_POSN                     equ 0000h
PID1ACCHH_ACC24_POSITION                 equ 0000h
PID1ACCHH_ACC24_SIZE                     equ 0001h
PID1ACCHH_ACC24_LENGTH                   equ 0001h
PID1ACCHH_ACC24_MASK                     equ 0001h
PID1ACCHH_ACC25_POSN                     equ 0001h
PID1ACCHH_ACC25_POSITION                 equ 0001h
PID1ACCHH_ACC25_SIZE                     equ 0001h
PID1ACCHH_ACC25_LENGTH                   equ 0001h
PID1ACCHH_ACC25_MASK                     equ 0002h
PID1ACCHH_ACC26_POSN                     equ 0002h
PID1ACCHH_ACC26_POSITION                 equ 0002h
PID1ACCHH_ACC26_SIZE                     equ 0001h
PID1ACCHH_ACC26_LENGTH                   equ 0001h
PID1ACCHH_ACC26_MASK                     equ 0004h
PID1ACCHH_ACC27_POSN                     equ 0003h
PID1ACCHH_ACC27_POSITION                 equ 0003h
PID1ACCHH_ACC27_SIZE                     equ 0001h
PID1ACCHH_ACC27_LENGTH                   equ 0001h
PID1ACCHH_ACC27_MASK                     equ 0008h
PID1ACCHH_ACC28_POSN                     equ 0004h
PID1ACCHH_ACC28_POSITION                 equ 0004h
PID1ACCHH_ACC28_SIZE                     equ 0001h
PID1ACCHH_ACC28_LENGTH                   equ 0001h
PID1ACCHH_ACC28_MASK                     equ 0010h
PID1ACCHH_ACC29_POSN                     equ 0005h
PID1ACCHH_ACC29_POSITION                 equ 0005h
PID1ACCHH_ACC29_SIZE                     equ 0001h
PID1ACCHH_ACC29_LENGTH                   equ 0001h
PID1ACCHH_ACC29_MASK                     equ 0020h
PID1ACCHH_ACC30_POSN                     equ 0006h
PID1ACCHH_ACC30_POSITION                 equ 0006h
PID1ACCHH_ACC30_SIZE                     equ 0001h
PID1ACCHH_ACC30_LENGTH                   equ 0001h
PID1ACCHH_ACC30_MASK                     equ 0040h
PID1ACCHH_ACC31_POSN                     equ 0007h
PID1ACCHH_ACC31_POSITION                 equ 0007h
PID1ACCHH_ACC31_SIZE                     equ 0001h
PID1ACCHH_ACC31_LENGTH                   equ 0001h
PID1ACCHH_ACC31_MASK                     equ 0080h

