GopalSaraf/Practicals/PSDL/include/proc/pic16f1615.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 079Ah
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0004h
CRCCON1_PLEN_LENGTH                      equ 0004h
CRCCON1_PLEN_MASK                        equ 000Fh
CRCCON1_DLEN_POSN                        equ 0004h
CRCCON1_DLEN_POSITION                    equ 0004h
CRCCON1_DLEN_SIZE                        equ 0004h
CRCCON1_DLEN_LENGTH                      equ 0004h
CRCCON1_DLEN_MASK                        equ 00F0h
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_DLEN0_POSN                       equ 0004h
CRCCON1_DLEN0_POSITION                   equ 0004h
CRCCON1_DLEN0_SIZE                       equ 0001h
CRCCON1_DLEN0_LENGTH                     equ 0001h
CRCCON1_DLEN0_MASK                       equ 0010h
CRCCON1_DLEN1_POSN                       equ 0005h
CRCCON1_DLEN1_POSITION                   equ 0005h
CRCCON1_DLEN1_SIZE                       equ 0001h
CRCCON1_DLEN1_LENGTH                     equ 0001h
CRCCON1_DLEN1_MASK                       equ 0020h
CRCCON1_DLEN2_POSN                       equ 0006h
CRCCON1_DLEN2_POSITION                   equ 0006h
CRCCON1_DLEN2_SIZE                       equ 0001h
CRCCON1_DLEN2_LENGTH                     equ 0001h
CRCCON1_DLEN2_MASK                       equ 0040h
CRCCON1_DLEN3_POSN                       equ 0007h
CRCCON1_DLEN3_POSITION                   equ 0007h
CRCCON1_DLEN3_SIZE                       equ 0001h
CRCCON1_DLEN3_LENGTH                     equ 0001h
CRCCON1_DLEN3_MASK                       equ 0080h
CRCCON1_CRCPLEN_POSN                     equ 0000h
CRCCON1_CRCPLEN_POSITION                 equ 0000h
CRCCON1_CRCPLEN_SIZE                     equ 0004h
CRCCON1_CRCPLEN_LENGTH                   equ 0004h
CRCCON1_CRCPLEN_MASK                     equ 000Fh
CRCCON1_CRCDLEN_POSN                     equ 0004h
CRCCON1_CRCDLEN_POSITION                 equ 0004h
CRCCON1_CRCDLEN_SIZE                     equ 0004h
CRCCON1_CRCDLEN_LENGTH                   equ 0004h
CRCCON1_CRCDLEN_MASK                     equ 00F0h
CRCCON1_CRCPLEN0_POSN                    equ 0000h
CRCCON1_CRCPLEN0_POSITION                equ 0000h
CRCCON1_CRCPLEN0_SIZE                    equ 0001h
CRCCON1_CRCPLEN0_LENGTH                  equ 0001h
CRCCON1_CRCPLEN0_MASK                    equ 0001h
CRCCON1_CRCPLEN1_POSN                    equ 0001h
CRCCON1_CRCPLEN1_POSITION                equ 0001h
CRCCON1_CRCPLEN1_SIZE                    equ 0001h
CRCCON1_CRCPLEN1_LENGTH                  equ 0001h
CRCCON1_CRCPLEN1_MASK                    equ 0002h
CRCCON1_CRCPLEN2_POSN                    equ 0002h
CRCCON1_CRCPLEN2_POSITION                equ 0002h
CRCCON1_CRCPLEN2_SIZE                    equ 0001h
CRCCON1_CRCPLEN2_LENGTH                  equ 0001h
CRCCON1_CRCPLEN2_MASK                    equ 0004h
CRCCON1_CRCPLEN3_POSN                    equ 0003h
CRCCON1_CRCPLEN3_POSITION                equ 0003h
CRCCON1_CRCPLEN3_SIZE                    equ 0001h
CRCCON1_CRCPLEN3_LENGTH                  equ 0001h
CRCCON1_CRCPLEN3_MASK                    equ 0008h
CRCCON1_CRCDLEN0_POSN                    equ 0004h
CRCCON1_CRCDLEN0_POSITION                equ 0004h
CRCCON1_CRCDLEN0_SIZE                    equ 0001h
CRCCON1_CRCDLEN0_LENGTH                  equ 0001h
CRCCON1_CRCDLEN0_MASK                    equ 0010h
CRCCON1_CRCDLEN1_POSN                    equ 0005h
CRCCON1_CRCDLEN1_POSITION                equ 0005h
CRCCON1_CRCDLEN1_SIZE                    equ 0001h
CRCCON1_CRCDLEN1_LENGTH                  equ 0001h
CRCCON1_CRCDLEN1_MASK                    equ 0020h
CRCCON1_CRCDLEN2_POSN                    equ 0006h
CRCCON1_CRCDLEN2_POSITION                equ 0006h
CRCCON1_CRCDLEN2_SIZE                    equ 0001h
CRCCON1_CRCDLEN2_LENGTH                  equ 0001h
CRCCON1_CRCDLEN2_MASK                    equ 0040h
CRCCON1_CRCDLEN3_POSN                    equ 0007h
CRCCON1_CRCDLEN3_POSITION                equ 0007h
CRCCON1_CRCDLEN3_SIZE                    equ 0001h
CRCCON1_CRCDLEN3_LENGTH                  equ 0001h
CRCCON1_CRCDLEN3_MASK                    equ 0080h

// Register: AT1RESL
#define AT1RESL AT1RESL
AT1RESL                                  equ 080Ch
// bitfield definitions
AT1RESL_AT1RES0_POSN                     equ 0000h
AT1RESL_AT1RES0_POSITION                 equ 0000h
AT1RESL_AT1RES0_SIZE                     equ 0001h
AT1RESL_AT1RES0_LENGTH                   equ 0001h
AT1RESL_AT1RES0_MASK                     equ 0001h
AT1RESL_AT1RES1_POSN                     equ 0001h
AT1RESL_AT1RES1_POSITION                 equ 0001h
AT1RESL_AT1RES1_SIZE                     equ 0001h
AT1RESL_AT1RES1_LENGTH                   equ 0001h
AT1RESL_AT1RES1_MASK                     equ 0002h
AT1RESL_AT1RES2_POSN                     equ 0002h
AT1RESL_AT1RES2_POSITION                 equ 0002h
AT1RESL_AT1RES2_SIZE                     equ 0001h
AT1RESL_AT1RES2_LENGTH                   equ 0001h
AT1RESL_AT1RES2_MASK                     equ 0004h
AT1RESL_AT1RES3_POSN                     equ 0003h
AT1RESL_AT1RES3_POSITION                 equ 0003h
AT1RESL_AT1RES3_SIZE                     equ 0001h
AT1RESL_AT1RES3_LENGTH                   equ 0001h
AT1RESL_AT1RES3_MASK                     equ 0008h
AT1RESL_AT1RES4_POSN                     equ 0004h
AT1RESL_AT1RES4_POSITION                 equ 0004h
AT1RESL_AT1RES4_SIZE                     equ 0001h
AT1RESL_AT1RES4_LENGTH                   equ 0001h
AT1RESL_AT1RES4_MASK                     equ 0010h
AT1RESL_AT1RES5_POSN                     equ 0005h
AT1RESL_AT1RES5_POSITION                 equ 0005h
AT1RESL_AT1RES5_SIZE                     equ 0001h
AT1RESL_AT1RES5_LENGTH                   equ 0001h
AT1RESL_AT1RES5_MASK                     equ 0020h
AT1RESL_AT1RES6_POSN                     equ 0006h
AT1RESL_AT1RES6_POSITION                 equ 0006h
AT1RESL_AT1RES6_SIZE                     equ 0001h
AT1RESL_AT1RES6_LENGTH                   equ 0001h
AT1RESL_AT1RES6_MASK                     equ 0040h
AT1RESL_AT1RES7_POSN                     equ 0007h
AT1RESL_AT1RES7_POSITION                 equ 0007h
AT1RESL_AT1RES7_SIZE                     equ 0001h
AT1RESL_AT1RES7_LENGTH                   equ 0001h
AT1RESL_AT1RES7_MASK                     equ 0080h
AT1RESL_RES0_POSN                        equ 0000h
AT1RESL_RES0_POSITION                    equ 0000h
AT1RESL_RES0_SIZE                        equ 0001h
AT1RESL_RES0_LENGTH                      equ 0001h
AT1RESL_RES0_MASK                        equ 0001h
AT1RESL_RES1_POSN                        equ 0001h
AT1RESL_RES1_POSITION                    equ 0001h
AT1RESL_RES1_SIZE                        equ 0001h
AT1RESL_RES1_LENGTH                      equ 0001h
AT1RESL_RES1_MASK                        equ 0002h
AT1RESL_RES2_POSN                        equ 0002h
AT1RESL_RES2_POSITION                    equ 0002h
AT1RESL_RES2_SIZE                        equ 0001h
AT1RESL_RES2_LENGTH                      equ 0001h
AT1RESL_RES2_MASK                        equ 0004h
AT1RESL_RES3_POSN                        equ 0003h
AT1RESL_RES3_POSITION                    equ 0003h
AT1RESL_RES3_SIZE                        equ 0001h
AT1RESL_RES3_LENGTH                      equ 0001h
AT1RESL_RES3_MASK                        equ 0008h
AT1RESL_RES4_POSN                        equ 0004h
AT1RESL_RES4_POSITION                    equ 0004h
AT1RESL_RES4_SIZE                        equ 0001h
AT1RESL_RES4_LENGTH                      equ 0001h
AT1RESL_RES4_MASK                        equ 0010h
AT1RESL_RES5_POSN                        equ 0005h
AT1RESL_RES5_POSITION                    equ 0005h
AT1RESL_RES5_SIZE                        equ 0001h
AT1RESL_RES5_LENGTH                      equ 0001h
AT1RESL_RES5_MASK                        equ 0020h
AT1RESL_RES6_POSN                        equ 0006h
AT1RESL_RES6_POSITION                    equ 0006h
AT1RESL_RES6_SIZE                        equ 0001h
AT1RESL_RES6_LENGTH                      equ 0001h
AT1RESL_RES6_MASK                        equ 0040h
AT1RESL_RES7_POSN                        equ 0007h
AT1RESL_RES7_POSITION                    equ 0007h
AT1RESL_RES7_SIZE                        equ 0001h
AT1RESL_RES7_LENGTH                      equ 0001h
AT1RESL_RES7_MASK                        equ 0080h

// Register: AT1RESH
#define AT1RESH AT1RESH
AT1RESH                                  equ 080Dh
// bitfield definitions
AT1RESH_AT1RES8_POSN                     equ 0000h
AT1RESH_AT1RES8_POSITION                 equ 0000h
AT1RESH_AT1RES8_SIZE                     equ 0001h
AT1RESH_AT1RES8_LENGTH                   equ 0001h
AT1RESH_AT1RES8_MASK                     equ 0001h
AT1RESH_AT1RES9_POSN                     equ 0001h
AT1RESH_AT1RES9_POSITION                 equ 0001h
AT1RESH_AT1RES9_SIZE                     equ 0001h
AT1RESH_AT1RES9_LENGTH                   equ 0001h
AT1RESH_AT1RES9_MASK                     equ 0002h
AT1RESH_RES8_POSN                        equ 0000h
AT1RESH_RES8_POSITION                    equ 0000h
AT1RESH_RES8_SIZE                        equ 0001h
AT1RESH_RES8_LENGTH                      equ 0001h
AT1RESH_RES8_MASK                        equ 0001h
AT1RESH_RES9_POSN                        equ 0001h
AT1RESH_RES9_POSITION                    equ 0001h
AT1RESH_RES9_SIZE                        equ 0001h
AT1RESH_RES9_LENGTH                      equ 0001h
AT1RESH_RES9_MASK                        equ 0002h

// Register: AT1MISSL
#define AT1MISSL AT1MISSL
AT1MISSL                                 equ 080Eh
// bitfield definitions
AT1MISSL_AT1MISS0_POSN                   equ 0000h
AT1MISSL_AT1MISS0_POSITION               equ 0000h
AT1MISSL_AT1MISS0_SIZE                   equ 0001h
AT1MISSL_AT1MISS0_LENGTH                 equ 0001h
AT1MISSL_AT1MISS0_MASK                   equ 0001h
AT1MISSL_AT1MISS1_POSN                   equ 0001h
AT1MISSL_AT1MISS1_POSITION               equ 0001h
AT1MISSL_AT1MISS1_SIZE                   equ 0001h
AT1MISSL_AT1MISS1_LENGTH                 equ 0001h
AT1MISSL_AT1MISS1_MASK                   equ 0002h
AT1MISSL_AT1MISS2_POSN                   equ 0002h
AT1MISSL_AT1MISS2_POSITION               equ 0002h
AT1MISSL_AT1MISS2_SIZE                   equ 0001h
AT1MISSL_AT1MISS2_LENGTH                 equ 0001h
AT1MISSL_AT1MISS2_MASK                   equ 0004h
AT1MISSL_AT1MISS3_POSN                   equ 0003h
AT1MISSL_AT1MISS3_POSITION               equ 0003h
AT1MISSL_AT1MISS3_SIZE                   equ 0001h
AT1MISSL_AT1MISS3_LENGTH                 equ 0001h
AT1MISSL_AT1MISS3_MASK                   equ 0008h
AT1MISSL_AT1MISS4_POSN                   equ 0004h
AT1MISSL_AT1MISS4_POSITION               equ 0004h
AT1MISSL_AT1MISS4_SIZE                   equ 0001h
AT1MISSL_AT1MISS4_LENGTH                 equ 0001h
AT1MISSL_AT1MISS4_MASK                   equ 0010h
AT1MISSL_AT1MISS5_POSN                   equ 0005h
AT1MISSL_AT1MISS5_POSITION               equ 0005h
AT1MISSL_AT1MISS5_SIZE                   equ 0001h
AT1MISSL_AT1MISS5_LENGTH                 equ 0001h
AT1MISSL_AT1MISS5_MASK                   equ 0020h
AT1MISSL_AT1MISS6_POSN                   equ 0006h
AT1MISSL_AT1MISS6_POSITION               equ 0006h
AT1MISSL_AT1MISS6_SIZE                   equ 0001h
AT1MISSL_AT1MISS6_LENGTH                 equ 0001h
AT1MISSL_AT1MISS6_MASK                   equ 0040h
AT1MISSL_AT1MISS7_POSN                   equ 0007h
AT1MISSL_AT1MISS7_POSITION               equ 0007h
AT1MISSL_AT1MISS7_SIZE                   equ 0001h
AT1MISSL_AT1MISS7_LENGTH                 equ 0001h
AT1MISSL_AT1MISS7_MASK                   equ 0080h
AT1MISSL_MISS0_POSN                      equ 0000h
AT1MISSL_MISS0_POSITION                  equ 0000h
AT1MISSL_MISS0_SIZE                      equ 0001h
AT1MISSL_MISS0_LENGTH                    equ 0001h
AT1MISSL_MISS0_MASK                      equ 0001h
AT1MISSL_MISS1_POSN                      equ 0001h
AT1MISSL_MISS1_POSITION                  equ 0001h
AT1MISSL_MISS1_SIZE                      equ 0001h
AT1MISSL_MISS1_LENGTH                    equ 0001h
AT1MISSL_MISS1_MASK                      equ 0002h
AT1MISSL_MISS2_POSN                      equ 0002h
AT1MISSL_MISS2_POSITION                  equ 0002h
AT1MISSL_MISS2_SIZE                      equ 0001h
AT1MISSL_MISS2_LENGTH                    equ 0001h
AT1MISSL_MISS2_MASK                      equ 0004h
AT1MISSL_MISS3_POSN                      equ 0003h
AT1MISSL_MISS3_POSITION                  equ 0003h
AT1MISSL_MISS3_SIZE                      equ 0001h
AT1MISSL_MISS3_LENGTH                    equ 0001h
AT1MISSL_MISS3_MASK                      equ 0008h
AT1MISSL_MISS4_POSN                      equ 0004h
AT1MISSL_MISS4_POSITION                  equ 0004h
AT1MISSL_MISS4_SIZE                      equ 0001h
AT1MISSL_MISS4_LENGTH                    equ 0001h
AT1MISSL_MISS4_MASK                      equ 0010h
AT1MISSL_MISS5_POSN                      equ 0005h
AT1MISSL_MISS5_POSITION                  equ 0005h
AT1MISSL_MISS5_SIZE                      equ 0001h
AT1MISSL_MISS5_LENGTH                    equ 0001h
AT1MISSL_MISS5_MASK                      equ 0020h
AT1MISSL_MISS6_POSN                      equ 0006h
AT1MISSL_MISS6_POSITION                  equ 0006h
AT1MISSL_MISS6_SIZE                      equ 0001h
AT1MISSL_MISS6_LENGTH                    equ 0001h
AT1MISSL_MISS6_MASK                      equ 0040h
AT1MISSL_MISS7_POSN                      equ 0007h
AT1MISSL_MISS7_POSITION                  equ 0007h
AT1MISSL_MISS7_SIZE                      equ 0001h
AT1MISSL_MISS7_LENGTH                    equ 0001h
AT1MISSL_MISS7_MASK                      equ 0080h

