GopalSaraf/Practicals/PSDL/include/proc/pic16f1615.inc
#define SMT2PR18                         BANKMASK(SMT2PRU), 2
#define SMT2PR19                         BANKMASK(SMT2PRU), 3
#define SMT2PR2                          BANKMASK(SMT2PRL), 2
#define SMT2PR20                         BANKMASK(SMT2PRU), 4
#define SMT2PR21                         BANKMASK(SMT2PRU), 5
#define SMT2PR22                         BANKMASK(SMT2PRU), 6
#define SMT2PR23                         BANKMASK(SMT2PRU), 7
#define SMT2PR3                          BANKMASK(SMT2PRL), 3
#define SMT2PR4                          BANKMASK(SMT2PRL), 4
#define SMT2PR5                          BANKMASK(SMT2PRL), 5
#define SMT2PR6                          BANKMASK(SMT2PRL), 6
#define SMT2PR7                          BANKMASK(SMT2PRL), 7
#define SMT2PR8                          BANKMASK(SMT2PRH), 0
#define SMT2PR9                          BANKMASK(SMT2PRH), 1
#define SMT2PRAIE                        BANKMASK(PIE4), 4
#define SMT2PRAIF                        BANKMASK(PIR4), 4
#define SMT2PS0                          BANKMASK(SMT2CON0), 0
#define SMT2PS1                          BANKMASK(SMT2CON0), 1
#define SMT2PWAIE                        BANKMASK(PIE4), 5
#define SMT2PWAIF                        BANKMASK(PIR4), 5
#define SMT2REPEAT                       BANKMASK(SMT2CON1), 6
#define SMT2RESET                        BANKMASK(SMT2STAT), 5
#define SMT2SIGPPS0                      BANKMASK(SMT2SIGPPS), 0
#define SMT2SIGPPS1                      BANKMASK(SMT2SIGPPS), 1
#define SMT2SIGPPS2                      BANKMASK(SMT2SIGPPS), 2
#define SMT2SIGPPS3                      BANKMASK(SMT2SIGPPS), 3
#define SMT2SIGPPS4                      BANKMASK(SMT2SIGPPS), 4
#define SMT2SSEL0                        BANKMASK(SMT2SIG), 0
#define SMT2SSEL1                        BANKMASK(SMT2SIG), 1
#define SMT2SSEL2                        BANKMASK(SMT2SIG), 2
#define SMT2SSEL3                        BANKMASK(SMT2SIG), 3
#define SMT2SSEL4                        BANKMASK(SMT2SIG), 4
#define SMT2TMR0                         BANKMASK(SMT2TMRL), 0
#define SMT2TMR1                         BANKMASK(SMT2TMRL), 1
#define SMT2TMR10                        BANKMASK(SMT2TMRH), 2
#define SMT2TMR11                        BANKMASK(SMT2TMRH), 3
#define SMT2TMR12                        BANKMASK(SMT2TMRH), 4
#define SMT2TMR13                        BANKMASK(SMT2TMRH), 5
#define SMT2TMR14                        BANKMASK(SMT2TMRH), 6
#define SMT2TMR15                        BANKMASK(SMT2TMRH), 7
#define SMT2TMR16                        BANKMASK(SMT2TMRU), 0
#define SMT2TMR17                        BANKMASK(SMT2TMRU), 1
#define SMT2TMR18                        BANKMASK(SMT2TMRU), 2
#define SMT2TMR19                        BANKMASK(SMT2TMRU), 3
#define SMT2TMR2                         BANKMASK(SMT2TMRL), 2
#define SMT2TMR20                        BANKMASK(SMT2TMRU), 4
#define SMT2TMR21                        BANKMASK(SMT2TMRU), 5
#define SMT2TMR22                        BANKMASK(SMT2TMRU), 6
#define SMT2TMR23                        BANKMASK(SMT2TMRU), 7
#define SMT2TMR3                         BANKMASK(SMT2TMRL), 3
#define SMT2TMR4                         BANKMASK(SMT2TMRL), 4
#define SMT2TMR5                         BANKMASK(SMT2TMRL), 5
#define SMT2TMR6                         BANKMASK(SMT2TMRL), 6
#define SMT2TMR7                         BANKMASK(SMT2TMRL), 7
#define SMT2TMR8                         BANKMASK(SMT2TMRH), 0
#define SMT2TMR9                         BANKMASK(SMT2TMRH), 1
#define SMT2TS                           BANKMASK(SMT2STAT), 2
#define SMT2WINPPS0                      BANKMASK(SMT2WINPPS), 0
#define SMT2WINPPS1                      BANKMASK(SMT2WINPPS), 1
#define SMT2WINPPS2                      BANKMASK(SMT2WINPPS), 2
#define SMT2WINPPS3                      BANKMASK(SMT2WINPPS), 3
#define SMT2WINPPS4                      BANKMASK(SMT2WINPPS), 4
#define SMT2WS                           BANKMASK(SMT2STAT), 1
#define SMT2WSEL0                        BANKMASK(SMT2WIN), 0
#define SMT2WSEL1                        BANKMASK(SMT2WIN), 1
#define SMT2WSEL2                        BANKMASK(SMT2WIN), 2
#define SMT2WSEL3                        BANKMASK(SMT2WIN), 3
#define SMT2WSEL4                        BANKMASK(SMT2WIN), 4
#define SMTWINPPS0                       BANKMASK(SMT1WINPPS), 0
#define SMTWINPPS1                       BANKMASK(SMT1WINPPS), 1
#define SMTWINPPS2                       BANKMASK(SMT1WINPPS), 2
#define SMTWINPPS3                       BANKMASK(SMT1WINPPS), 3
#define SMTWINPPS4                       BANKMASK(SMT1WINPPS), 4
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPCLKPPS0                       BANKMASK(SSPCLKPPS), 0
#define SSPCLKPPS1                       BANKMASK(SSPCLKPPS), 1
#define SSPCLKPPS2                       BANKMASK(SSPCLKPPS), 2
#define SSPCLKPPS3                       BANKMASK(SSPCLKPPS), 3
#define SSPCLKPPS4                       BANKMASK(SSPCLKPPS), 4
#define SSPDATPPS0                       BANKMASK(SSPDATPPS), 0
#define SSPDATPPS1                       BANKMASK(SSPDATPPS), 1
#define SSPDATPPS2                       BANKMASK(SSPDATPPS), 2
#define SSPDATPPS3                       BANKMASK(SSPDATPPS), 3
#define SSPDATPPS4                       BANKMASK(SSPDATPPS), 4
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define SSPSSPPS0                        BANKMASK(SSPSSPPS), 0
#define SSPSSPPS1                        BANKMASK(SSPSSPPS), 1
#define SSPSSPPS2                        BANKMASK(SSPSSPPS), 2
#define SSPSSPPS3                        BANKMASK(SSPSSPPS), 3
#define SSPSSPPS4                        BANKMASK(SSPSSPPS), 4
#define STATE                            BANKMASK(WDTTMR), 2
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define STPT0                            BANKMASK(AT1STPTL), 0
#define STPT1                            BANKMASK(AT1STPTL), 1
#define STPT10                           BANKMASK(AT1STPTH), 2
#define STPT11                           BANKMASK(AT1STPTH), 3
#define STPT12                           BANKMASK(AT1STPTH), 4
#define STPT13                           BANKMASK(AT1STPTH), 5
#define STPT14                           BANKMASK(AT1STPTH), 6
#define STPT2                            BANKMASK(AT1STPTL), 2
#define STPT3                            BANKMASK(AT1STPTL), 3
#define STPT4                            BANKMASK(AT1STPTL), 4
#define STPT5                            BANKMASK(AT1STPTL), 5
#define STPT6                            BANKMASK(AT1STPTL), 6
#define STPT7                            BANKMASK(AT1STPTL), 7
#define STPT8                            BANKMASK(AT1STPTH), 0
#define STPT9                            BANKMASK(AT1STPTH), 1
#define STRA                             BANKMASK(CWG1OCON0), 0
#define STRB                             BANKMASK(CWG1OCON0), 1
#define STRC                             BANKMASK(CWG1OCON0), 2
#define STRD                             BANKMASK(CWG1OCON0), 3
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYNC                             BANKMASK(TX1STA), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PPS0                           BANKMASK(T2PPS), 0
#define T2PPS1                           BANKMASK(T2PPS), 1
#define T2PPS2                           BANKMASK(T2PPS), 2
#define T2PPS3                           BANKMASK(T2PPS), 3
#define T2PPS4                           BANKMASK(T2PPS), 4
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GPPS0                          BANKMASK(T3GPPS), 0
#define T3GPPS1                          BANKMASK(T3GPPS), 1
#define T3GPPS2                          BANKMASK(T3GPPS), 2
#define T3GPPS3                          BANKMASK(T3GPPS), 3
#define T3GPPS4                          BANKMASK(T3GPPS), 4
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GCON), 0
#define T3GSS1                           BANKMASK(T3GCON), 1
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3SYNC                           BANKMASK(T3CON), 2
#define T4CKPOL                          BANKMASK(T4HLT), 6
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CKSYNC                         BANKMASK(T4HLT), 5
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PPS0                           BANKMASK(T4PPS), 0
#define T4PPS1                           BANKMASK(T4PPS), 1
#define T4PPS2                           BANKMASK(T4PPS), 2
#define T4PPS3                           BANKMASK(T4PPS), 3
#define T4PPS4                           BANKMASK(T4PPS), 4
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2
#define T5CKIPPS3                        BANKMASK(T5CKIPPS), 3
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4
#define T5CKPS0                          BANKMASK(T5CON), 4
#define T5CKPS1                          BANKMASK(T5CON), 5
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3
#define T5GPOL                           BANKMASK(T5GCON), 6
#define T5GPPS0                          BANKMASK(T5GPPS), 0
#define T5GPPS1                          BANKMASK(T5GPPS), 1
#define T5GPPS2                          BANKMASK(T5GPPS), 2
#define T5GPPS3                          BANKMASK(T5GPPS), 3
#define T5GPPS4                          BANKMASK(T5GPPS), 4
#define T5GSPM                           BANKMASK(T5GCON), 4
#define T5GSS0                           BANKMASK(T5GCON), 0
#define T5GSS1                           BANKMASK(T5GCON), 1
#define T5GTM                            BANKMASK(T5GCON), 5
#define T5GVAL                           BANKMASK(T5GCON), 2
#define T5SYNC                           BANKMASK(T5CON), 2
#define T6CKPOL                          BANKMASK(T6HLT), 6
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CKSYNC                         BANKMASK(T6HLT), 5
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PPS0                           BANKMASK(T6PPS), 0
#define T6PPS1                           BANKMASK(T6PPS), 1
#define T6PPS2                           BANKMASK(T6PPS), 2
#define T6PPS3                           BANKMASK(T6PPS), 3
#define T6PPS4                           BANKMASK(T6PPS), 4
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2AS                           BANKMASK(CWG1AS1), 4
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 7
#define TMR3CS0                          BANKMASK(T3CON), 6
#define TMR3CS1                          BANKMASK(T3CON), 7
#define TMR3GE                           BANKMASK(T3GCON), 7
#define TMR3GIE                          BANKMASK(PIE5), 7
#define TMR3GIF                          BANKMASK(PIR5), 7
#define TMR3IE                           BANKMASK(PIE5), 6
#define TMR3IF                           BANKMASK(PIR5), 6
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4AS                           BANKMASK(CWG1AS1), 5
#define TMR4IE                           BANKMASK(PIE2), 1
#define TMR4IF                           BANKMASK(PIR2), 1
#define TMR4ON                           BANKMASK(T4CON), 7
#define TMR5CS0                          BANKMASK(T5CON), 6
#define TMR5CS1                          BANKMASK(T5CON), 7
#define TMR5GE                           BANKMASK(T5GCON), 7
#define TMR5GIE                          BANKMASK(PIE5), 5
#define TMR5GIF                          BANKMASK(PIR5), 5
#define TMR5IE                           BANKMASK(PIE5), 4
#define TMR5IF                           BANKMASK(PIR5), 4
#define TMR5ON                           BANKMASK(T5CON), 0
#define TMR6AS                           BANKMASK(CWG1AS1), 6
#define TMR6IE                           BANKMASK(PIE2), 2
#define TMR6IF                           BANKMASK(PIR2), 2
#define TMR6ON                           BANKMASK(T6CON), 7
#define TRIGSEL0                         BANKMASK(ADCON2), 3
#define TRIGSEL1                         BANKMASK(ADCON2), 4
#define TRIGSEL2                         BANKMASK(ADCON2), 5
#define TRIGSEL3                         BANKMASK(ADCON2), 6
#define TRIGSEL4                         BANKMASK(ADCON2), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRMT                             BANKMASK(TX1STA), 1
#define TSEL0                            BANKMASK(SCANTRIG), 0
#define TSEL1                            BANKMASK(SCANTRIG), 1
#define TSEL2                            BANKMASK(SCANTRIG), 2
#define TSEL3                            BANKMASK(SCANTRIG), 3
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX9                              BANKMASK(TX1STA), 6
#define TX9D                             BANKMASK(TX1STA), 0
#define TXEN                             BANKMASK(TX1STA), 5
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define UA                               BANKMASK(SSP1STAT), 1
#define VALID                            BANKMASK(AT1CON1), 0
#define VREGPM0                          BANKMASK(VREGCON), 0
#define VREGPM1                          BANKMASK(VREGCON), 1
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
#define WDTPS2                           BANKMASK(WDTCON0), 3
#define WDTPS3                           BANKMASK(WDTCON0), 4
